{
  "name": "Renzo Avila",
  "location": "BCN - ES",
  "headline": "DevSecOps Engineer & Cloud Security Specialist",
  "summary": "DevSecOps Engineer with 6 years of experience integrating security into CI/CD pipelines and managing ISO 27001-compliant cloud infrastructures. Trilingual in English, Portuguese, and Spanish.",
  "contact": {
    "linkedin": "LinkedIn",
    "github": "GitHub",
    "phone": "+44 330 122 9696",
    "email": "RENZO@AVILA.WS",
    "website": "AVILA.WS"
  },
  "experience": [
    {
      "company": "R2",
      "type": "NeoBank",
      "position": "DevSecOps Engineer",
      "location": "Mexico",
      "period": "Oct 2022 - Present",
      "achievements": [
        "Led and coordinated the ISO 27001 certification, reducing security incidents by 50% and enhancing AWS security with robust endpoint protection and incident management policies.",
        "Developed automated security testing and integrated advanced code analysis, improving software protection by 45% and reducing production vulnerabilities by 25%.",
        "Conducted security audits and proactive risk assessments, increasing threat detection capabilities by 30% and ensuring faster incident response, reducing potential attack impact by 20%.",
        "Designed and enforced robust cloud security policies, ensuring compliance with industry standards and fortifying AWS IAM governance to mitigate unauthorized access risks."
      ]
    },
    {
      "company": "B89",
      "type": "NeoBank",
      "position": "DevSecOps Engineer",
      "location": "Peru",
      "period": "Oct 2020 - Sep 2022",
      "achievements": [
        "Established and fortified B89's security infrastructure, reducing vulnerabilities by 50% and integrating comprehensive security measures in fintech applications, enhancing overall system resilience.",
        "Directed key blockchain projects, managing infrastructure across multiple blockchain protocols, resulting in a 60% increase in transaction throughput and a 40% decrease in operational costs.",
        "Led cross-functional teams to integrate advanced security into financial solutions, enhancing operational efficiency by 35% and improving quality metrics by 30%.",
        "Automated security processes within CI/CD pipelines, embedding compliance enforcement, vulnerability scanning, and security gates into the development lifecycle."
      ]
    },
    {
      "company": "BCP",
      "type": "Bank",
      "position": "DevSecOps Engineer",
      "location": "Peru",
      "period": "Oct 2019 - Sep 2020",
      "achievements": [
        "Led cybersecurity initiatives, collaborating with departments to oversee cloud-based applications and new implementations, ensuring optimal standards and resulting in a 30% increase in system uptime.",
        "Enhanced software security by integrating advanced code analysis techniques, boosting protection standards by 35% and reducing production code vulnerabilities by 25%.",
        "Coordinated cross-departmental efforts, deploying and securing new banking applications and systems, aligning with BCP's strategic goals, leading to a 30% reduction in deployment times."
      ]
    },
    {
      "company": "KELLER WILLIAMS",
      "type": "Realty",
      "position": "Front-End Software Engineer",
      "location": "United States",
      "period": "Oct 2018 - Sep 2019",
      "achievements": [
        "Optimized CRM and ERP systems with React.js, collaborating with DevOps to automate security checks and streamline workflows, boosting user experience by 30%.",
        "Enhanced front-end security and API integrations, working with DevOps to improve CI/CD pipelines, increasing system resilience and performance by 25%.",
        "Aligned UX/UI development with secure DevOps practices, ensuring automated testing, compliance enforcement, and seamless deployments, improving business applications by 20%."
      ]
    },
    {
      "company": "NTT DATA",
      "type": "Consulting Firm",
      "position": "Blockchain Software Engineer",
      "location": "Peru",
      "period": "Oct 2015 - Sep 2018",
      "achievements": [
        "Led over 20 blockchain projects, enhancing security and efficiency for financial and enterprise applications across Latin America, the Caribbean, and Europe.",
        "Designed and deployed scalable blockchain architectures, improving data integrity, security, and operational processes, increasing efficiency by 40% and reducing errors by 30%.",
        "Managed blockchain infrastructure and innovation, optimizing performance by 25%, ensuring seamless deployment, scalability, and reliability for enterprise-grade solutions."
      ]
    },
    {
      "company": "PARAISO CREATIVO",
      "type": "Consulting Firm",
      "position": "Android Software Engineer",
      "location": "Venezuela",
      "period": "Oct 2013 - Sep 2015",
      "achievements": [
        "Developed and launched secure Android applications, integrating geolocation and payment systems, enhancing user engagement by 10% and operational efficiency.",
        "Optimized application security and performance, incorporating secure API integrations and encryption protocols, leading to a 40% increase in user satisfaction.",
        "Collaborated with cross-functional teams, implementing best practices in secure software development, improving app reliability and reducing errors by 20%."
      ]
    }
  ],
  "education": [
    {
      "institution": "Central University of Technology",
      "degree": "B.Sc. in Systems Engineering",
      "description": "Specialized in IT-driven business optimization and strategic data management."
    },
    {
      "institution": "Central University of Technology",
      "degree": "B.Sc. in Business Administration and Management",
      "description": "Competent in operational efficiency and strategic administrative leadership."
    },
    {
      "institution": "Forensic Science and Cybersecurity Academy",
      "degree": "Diploma. Forensic Science and Criminalistics",
      "description": "Specialized in forensic techniques and criminal analysis."
    },
    {
      "institution": "Forensic Science and Cybersecurity Academy",
      "degree": "Diploma. Forensic Computing and Cybercrime",
      "description": "Trained in cybercrime investigation and forensic computing."
    }
  ],
  "languages": [
    {
      "name": "English",
      "level": "Native"
    },
    {
      "name": "Portuguese",
      "level": "Native"
    },
    {
      "name": "Spanish",
      "level": "Native"
    },
    {
      "name": "French",
      "level": "Basic"
    },
    {
      "name": "Italian",
      "level": "Basic"
    },
    {
      "name": "Catalan",
      "level": "Basic"
    }
  ],
  "technologies": {
    "cloud_devops": "AWS CLOUD DEVOPS AND INFRASTRUCTURE TOOLS: EC2, EKS, Lambda, Batch, CloudSearch, KMS, SNS, SQS, Blockchain, QLDB, Pinpoint, DynamoDB, RDS, CloudShell, X-Ray, API Gateway, SageMaker, Control Tower, CloudTrail, CloudWatch, CloudFormation, ​​VPC, ELB,VPN, Route 53, Macie, Inspector, Security Lake, GuardDuty, Detective, Cognito, WAF, Secrets Manager, Security Hub, Shield, CloudHSM, IAM Identity Center, Audit Manager, EBS, S3, Glacier, Docker, Kubernetes, Docker registry, Jenkins, JumpCloud, Prometheus, Terraform, Grafana, Argo CD, SSH, MSK, Fargate, CodeBuild, CodePipeline, App Runner.",
    "security": "SECURITY AND COMPLIANCE: Imperva, Synk, Veracode, Qualys, Fluid Attacks, Fortify, Sonatype, SonarCloud, Okta, Vanta, Anchore, Synopsys Black Duck, Trendmicro, OWASP, Acunetix, Burp Suite, Checkmarx, Prisma Cloud.",
    "development": "DEVELOPMENT AND FRAMEWORKS: JavaScript, TypeScript, Java, Python, Rust, Go, C#, PHP, Ruby, SQL, Visual Basic, Swift, Kotlin, HTML/CSS, Bash, Dart, Node.js, Postman, Git, Gitlab, Github, BitBucket, Visual Studio Code, CloudFlare, JSON, VIM, Nano, Heroku, Selenium, Webpack, Firebase Crashlytics, NPM, Google Workspace, React, React.js, React Native, Express.js, Next, Ionic, Angular, Electron, Laravel, Symfony, Rails, Vue.js, jQuery, NativeScript, Django, Flask, Flutter, Pytest, Jest, Mocha, Jasmine, Trello, Slack, Shortcut, Jira, BambooHR, ClickUp, Zeplin, Miro, Figma, Kafka, FastAPI, Nuxt.js, NestJS, Hugo.",
    "database": "DATABASE TECHNOLOGIES AND DATA ANALYTICS TOOLS: MongoDB, PostgreSQL, MySQL, SnowFlake, SQL Server, DBeaver, Liquibase, TiDB, MariaDB, Metabase, Tableau, Airflow, GraphQL, BigQuery, Redis, Elasticsearch, Redshift, Cassandra, CouchDB.",
    "blockchain": "BLOCKCHAIN AND EMERGING TECHNOLOGIES: Metamask, Remix, Ethers.js, web3.js, Geth, Ganache, Parity, Infura, Ethereum, Hyperledger Fabric, Truffle, Embark, OpenZeppelin Contracts, Solidity, Corda, Quorum, Ripple, IOTA, Stellar, Cardano, Uport, Oculus Quest, Polkadot, Tezos, Avalanche, Cosmos SDK, Chainlink, Solana, Algorand, Arbitrum."
  }
} 